<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Series对象的运算" data-toc-modified-id="Series对象的运算-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Series对象的运算</a></span><ul class="toc-item"><li><span><a href="#算数运算" data-toc-modified-id="算数运算-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>算数运算</a></span></li><li><span><a href="#比较运算" data-toc-modified-id="比较运算-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>比较运算</a></span></li><li><span><a href="#逻辑运算" data-toc-modified-id="逻辑运算-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>逻辑运算</a></span></li></ul></li><li><span><a href="#DataFrame对象的布尔索引" data-toc-modified-id="DataFrame对象的布尔索引-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>DataFrame对象的布尔索引</a></span><ul class="toc-item"><li><span><a href="#挑选出所有性别为男的员工信息" data-toc-modified-id="挑选出所有性别为男的员工信息-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>挑选出所有性别为男的员工信息</a></span></li><li><span><a href="#挑选出基本工资大于等于4000的员工信息" data-toc-modified-id="挑选出基本工资大于等于4000的员工信息-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>挑选出基本工资大于等于4000的员工信息</a></span></li><li><span><a href="#挑选出基本工资大于3500，-并且公司社保大于1000的员工信息" data-toc-modified-id="挑选出基本工资大于3500，-并且公司社保大于1000的员工信息-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>挑选出基本工资大于3500， 并且公司社保大于1000的员工信息</a></span></li><li><span><a href="#挑选出所有姓小的员工信息" data-toc-modified-id="挑选出所有姓小的员工信息-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>挑选出所有姓小的员工信息</a></span><ul class="toc-item"><li><span><a href="#方法一for循环" data-toc-modified-id="方法一for循环-2.4.1"><span class="toc-item-num">2.4.1&nbsp;&nbsp;</span>方法一for循环</a></span></li><li><span><a href="#方法二Series.map()方法" data-toc-modified-id="方法二Series.map()方法-2.4.2"><span class="toc-item-num">2.4.2&nbsp;&nbsp;</span>方法二Series.map()方法</a></span></li></ul></li><li><span><a href="#挑选出性别这列有缺失值得行" data-toc-modified-id="挑选出性别这列有缺失值得行-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>挑选出性别这列有缺失值得行</a></span></li><li><span><a href="#只要含有缺失值就挑选出来" data-toc-modified-id="只要含有缺失值就挑选出来-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>只要含有缺失值就挑选出来</a></span></li></ul></li></ul></div>

In [1]:
#全部行都能输出
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import numpy as np
import pandas as pd

# Series对象的运算

## 算数运算

In [3]:
a = pd.Series([1, 2, 3, 4, 1, 3])
a

0    1
1    2
2    3
3    4
4    1
5    3
dtype: int64

In [4]:
b = pd.Series([3, 4, 5, 4, 0, 3])
b

0    3
1    4
2    5
3    4
4    0
5    3
dtype: int64

In [5]:
a+b   # 对应位置上的元素进运算

0    4
1    6
2    8
3    8
4    1
5    6
dtype: int64

其余加减乘除等等都是一样的， 都是对应位置上的元素进行元素

## 比较运算

In [6]:
a
b

0    1
1    2
2    3
3    4
4    1
5    3
dtype: int64

0    3
1    4
2    5
3    4
4    0
5    3
dtype: int64

In [7]:
a>b

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [8]:
a==b

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

## 逻辑运算

|符号|含义|释义|
|----|----|----|
| \||or|或者|
|&|and|并且|
|~|not|取反|
|^|xor|异或|

In [9]:
c1 = a>b
c1

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [10]:
c2 = a==b
c2

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [11]:
c1 & c2  # 与运算， 这里不能用and， 只能用该符号

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [12]:
~c1  # 取反, 这里同样不能用not

0     True
1     True
2     True
3     True
4    False
5     True
dtype: bool

OK, 有了以上基础， 我们就可以来学习DataFrame对象的布尔索引

# DataFrame对象的布尔索引

In [13]:
df = pd.DataFrame({'姓名':['张三', '李四', '小明', '小红', '王五', ], 
                   '性别':['男', '男', np.nan, np.nan, '男'],
                   '基本工资': [3550, 3000, 4666, 4000, 3700],
                   '销售业绩': [20000, 24000, 21000, 25000, 16000],
                   '公司社保': [1340, 2300, 1100, 1200, 890],
                   '奖金'    : [300, 0, np.nan, 500, 300],
                   '在职情况': ['在职', '在职', '在职', '在职', '在职']})
df

   姓名   性别  基本工资   销售业绩  公司社保     奖金 在职情况
0  张三    男  3550  20000  1340  300.0   在职
1  李四    男  3000  24000  2300    0.0   在职
2  小明  NaN  4666  21000  1100    NaN   在职
3  小红  NaN  4000  25000  1200  500.0   在职
4  王五    男  3700  16000   890  300.0   在职

In [14]:
df['销售提成'] = df.销售业绩*0.2

In [15]:
df.insert(4, '销售提成', df.pop('销售提成'))

In [16]:
df

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
0  张三    男  3550  20000  4000.0  1340  300.0   在职
1  李四    男  3000  24000  4800.0  2300    0.0   在职
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职
4  王五    男  3700  16000  3200.0   890  300.0   在职

## 挑选出所有性别为男的员工信息

In [17]:
df.性别 == '男'

0     True
1     True
2    False
3    False
4     True
Name: 性别, dtype: bool

In [18]:
df[df.性别 == '男']  # 也就是说会返回bool值是True的那些行

   姓名 性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
0  张三  男  3550  20000  4000.0  1340  300.0   在职
1  李四  男  3000  24000  4800.0  2300    0.0   在职
4  王五  男  3700  16000  3200.0   890  300.0   在职

## 挑选出基本工资大于等于4000的员工信息

In [19]:
df

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
0  张三    男  3550  20000  4000.0  1340  300.0   在职
1  李四    男  3000  24000  4800.0  2300    0.0   在职
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职
4  王五    男  3700  16000  3200.0   890  300.0   在职

In [20]:
df.基本工资>=4000

0    False
1    False
2     True
3     True
4    False
Name: 基本工资, dtype: bool

In [21]:
df[df.基本工资>=4000]

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职

## 挑选出基本工资大于3500， 并且公司社保大于1000的员工信息

In [22]:
df

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
0  张三    男  3550  20000  4000.0  1340  300.0   在职
1  李四    男  3000  24000  4800.0  2300    0.0   在职
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职
4  王五    男  3700  16000  3200.0   890  300.0   在职

In [23]:
df.基本工资>3500

0     True
1    False
2     True
3     True
4     True
Name: 基本工资, dtype: bool

In [24]:
df.公司社保>1000

0     True
1     True
2     True
3     True
4    False
Name: 公司社保, dtype: bool

In [25]:
(df.基本工资>3500) & (df.公司社保>1000)  # 这里最好加括号

0     True
1    False
2     True
3     True
4    False
dtype: bool

In [26]:
df[(df.基本工资>3500) & (df.公司社保>1000)]

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
0  张三    男  3550  20000  4000.0  1340  300.0   在职
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职

## 挑选出所有姓小的员工信息

### 方法一for循环

In [27]:
df.姓名

0    张三
1    李四
2    小明
3    小红
4    王五
Name: 姓名, dtype: object

In [28]:
l = []
for i in df.姓名:
    if i[0] == '小':
        l.append(True)
    else:
        l.append(False)
print(l)

[False, False, True, True, False]

In [29]:
df[l]

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职

### 方法二Series.map()方法  
map()方法接受一个函数名

In [30]:
df.姓名

0    张三
1    李四
2    小明
3    小红
4    王五
Name: 姓名, dtype: object

In [31]:
def pr(x):
    if x[0] == '小':
        return True
    else:
        return False

In [32]:
df.姓名.map(pr)

0    False
1    False
2     True
3     True
4    False
Name: 姓名, dtype: bool

In [33]:
df[df.姓名.map(pr)]

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职

**或者有一种非常优雅的写法**

In [34]:
df[df.姓名.map(lambda x:x.startswith('小'))]

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职

**用列表推导式也行**

In [35]:
df[[x.startswith('小') for x in df.姓名]]

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职

In [36]:
df

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
0  张三    男  3550  20000  4000.0  1340  300.0   在职
1  李四    男  3000  24000  4800.0  2300    0.0   在职
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职
4  王五    男  3700  16000  3200.0   890  300.0   在职

## 挑选出性别这列有缺失值得行

In [37]:
df.性别.isnull()

0    False
1    False
2     True
3     True
4    False
Name: 性别, dtype: bool

In [38]:
df[df.性别.isnull()]

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职

此方法可用于挑选出某列含有缺失值的的行

## 只要含有缺失值就挑选出来

In [39]:
df

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
0  张三    男  3550  20000  4000.0  1340  300.0   在职
1  李四    男  3000  24000  4800.0  2300    0.0   在职
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职
4  王五    男  3700  16000  3200.0   890  300.0   在职

In [40]:
df.isnull()

      姓名     性别   基本工资   销售业绩   销售提成   公司社保     奖金   在职情况
0  False  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False  False
2  False   True  False  False  False  False   True  False
3  False   True  False  False  False  False  False  False
4  False  False  False  False  False  False  False  False

In [41]:
df.isnull().values

array([[False, False, False, False, False, False, False, False],
       [False, False, False, False, False, False, False, False],
       [False,  True, False, False, False, False,  True, False],
       [False,  True, False, False, False, False, False, False],
       [False, False, False, False, False, False, False, False]])

In [42]:
df[df.isnull().values]

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职

但是一行如果有多个缺失值会有重复输出， 这又该如何解决？？

In [43]:
df[df.isnull().values].drop_duplicates()

   姓名   性别  基本工资   销售业绩    销售提成  公司社保     奖金 在职情况
2  小明  NaN  4666  21000  4200.0  1100    NaN   在职
3  小红  NaN  4000  25000  5000.0  1200  500.0   在职

问题是有了缺失值该如何处理， 这个部分非常重要， 我们将在最后的部分为大家介绍数据预处理与特征工程！